Revit 2027 API
ExporterIFC.GetMaterialIdForCurrentExportState Method
 This gets the material id that is associated with the element in the current export state.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetMaterialIdForCurrentExportState()
Public Function GetMaterialIdForCurrentExportState As ElementId
public:
ElementId^ GetMaterialIdForCurrentExportState()
member GetMaterialIdForCurrentExportState : unit -> ElementId
Return Value
ElementId
 The material id.
Remarks
 Even though there could be several materials associated with the element (set during PushExportState()), unless the element has support for IfcMaterialLayerSet, IFC output will include only this one.
See Also
Reference
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace